# Алгоритм проигрышей разных сумм: 
# 2060:
#1 линия - ставка 100 - 4 вращения 
#5 линий - ставка 25 - 8 вращения
#9 линий - ставка 90 - 2 вращения
#5 линий - ставка 50 - 6 вращений
#3 линии - ставка 60 - 4 вращения 
#5 линий - ставка 50 - 4 вращения 
#3 линии - ставка 90 - 6 вращений

# 2290:
# 5 линий - ставка 15 - 13 вращений
# 1 линия - ставка 20 - 17 вращений
# 7 линий - ставка 35 - 15 вращений
# 3 линии - ставка 15 - 22 вращения 
# 9 линий - ставка 45 - 20 вращений

# 2740:
# 1 линия - ставка 20 - 8 вращений
# 1 линия - ставка 50 - 8 вращений
# 3 линия - ставка 60 - 8 вращений
# 5 линий - ставка 100 - 5 вращений
# 7 линий - ставка 35 - 7 вращений
# 3 линии - ставка 15 - 8 вращений
# 9 линий - ставка 45 - 8 вращения 
# 7 линий - ставка 70 - 6 вращения

# 2892:
# 9 линий - ставка 90 - 8 вращений 
# 1 линия - ставка 30 - 17 вращений
# 9 линий - ставка 36 - 12 вращений
# 7 линий - ставка 70 - 5 вращений
# 5 линий - ставка 50 - 14 вращений
# 5 линий - ставка 15 - 12 вращений

# 3032:
# 9 линий - ставка 90 - 8 вращений 
# 1 линия - ставка 30 - 17 вращений 
# 9 линий - ставка 36 - 12 вращений
# 5 линий - ставка 50 - 14 вращений
# 7 линий - ставка 70 - 7 вращений
# 5 линий - ставка 15 - 12 вращений

# 3680:
# 1 линия - ставка 100 - 7 вращения 
# 5 линий - ставка 25 - 12 вращения
# 9 линий - ставка 90 - 5 вращения
# 5 линий - ставка 50 - 17 вращений
# 3 линии - ставка 60 - 11 вращения 
# 3 линии - ставка 90 - 8 вращений

# 4600:
# 5 линий - ставка 100 - 6 вращений
# 7 линий - ставка 70 - 6 вращения
# 5 линий - ставка 100 - 6 вращений
# 1 линия - ставка 20 - 8 вращений
# 3 линия - ставка 60 - 8 вращений
# 9 линий - ставка 180 - 8 вращений
# 7 линий - ставка 35 - 7 вращений
# 1 линия - ставка 50 - 8 вращений
# 3 линии - ставка 15 - 8 вращений
# 9 линий - ставка 45 - 8 вращения

# 5385:
# 7 линия - ставка 70 - 20 раз старт
# 9 линий - ставка 45 - 13 раз старт
# 1 линия - ставка 50 - 18 раз старт
# 5 линий - ставка 50 - 23 раз старт
# 9 линия - ставка 90 - 15 раз старт

# 6310:
# 3 линии - ставка 150 - 7 вращений 
# 5 линий - ставка 100 - 12 вращений
# 7 линия - ставка 140 -  9 вращений 
# 1 линия - ставка 200 - 4 вращения
# 5 линий - ставка 150 - 8 вращений
# 9 линия - ставка 180 - 10 вращений